<?php


$x = 'title';
$title = 'PHP';
print ${$x};  //$$xでも可
echo PHP_EOL;

$data = ['山田', '掛谷', '日尾', '本田', '矢吹'];
print $data[3];
var_dump($data);
print_r($data);
echo PHP_EOL;



$members = [
  '山田太郎' => '千葉県府中市東町1-1-1',
  '掛谷翔太' => '広島県福岡市北町2-2-2',
  '日尾有宏' => '群馬県三次市南町3-3-3',
  '本多のぞみ' => '埼玉県豊田市西町4-4-4',
  '矢吹久美子' => '愛知県岡山市本町5-5-5',
];
print $members['山田太郎'];
echo PHP_EOL;

$data1 = [
  ['x-1', 'x-2', 'x-3'],
  ['y-1', 'y-2', 'y-3'],
  ['z-1', 'z-2', 'z-3'],
];
print $data1[1][0];
echo PHP_EOL;


$data2 = [
  [
    ['Sなし', 'Mなし', 'Lなし'],
    ['Sりんご', 'Mりんご', 'Lりんご'],
    ['S洋ナシ', 'M洋ナシ', 'L洋ナシ'],
  ],
  [
    ['Sもも', 'Mもも', 'Lもも'],
    ['Sすもも', 'Mすもも', 'Lすもも'],
    ['Sプラム', 'Mプラム', 'Lプラム'],
  ],
  [
    ['Sみかん', 'Mみかん', 'Lみかん'],
    ['S八朔', 'M八朔', 'L八朔'],
    ['Sネーブル', 'Mネーブル', 'Lネーブル'],
  ],
];

print $data2[0][1][0];
echo PHP_EOL;

$data3 = [
  [
    'name'  => '山田太郎',
    'age'  => 35,
    'sex'  => '男',
  ],
  [
    'name'  => '鈴木二郎',
    'age'  => 30,
    'sex'  => '男',
  ],
  [
    'name'  => '佐藤花子',
    'age'  => 25,
    'sex'  => '女',
  ],
];
print $data3[0]['name'];
echo PHP_EOL;


$data99 = [1 => '山田', 4 => '掛谷', '日尾'];
print_r($data99);
echo PHP_EOL;


$data100 = [
  'str' => 0, //文字列
  '7' => 1, //整数、整数値として正しい文字列はそのまま整数値
  '07' => 2, //整数（のように見えるが。10進数として妥当でない場合は文字列
  10.5 => 3, //少数点数　小数点以下は切り捨てられる
  true => 4, //bool値　trueは1、falseは0に変換される
  null => 5, //null値　空文字列に変換される
];
print_r($data100);




?>
